public/log/0003_More-run-time-and-more-vue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-02 Wed 08:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>More Run Time, More Vue</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Drew Crampsie" />
</head>
<body>
<div id="content">
<h1 class="title">More Run Time, More Vue</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd77d1a9">1. Our own <code>g_module_register</code></a></li>
<li><a href="#orgc373832">2. <code>G_Foreign</code> in <code>g_scm2host</code> and <code>g_host2scm</code></a></li>
<li><a href="#org3ec6e2c">3. <code>gxjs-fixes.ss</code></a></li>
<li><a href="#org1d1b6c3">4. Change the boot file into aync loading</a></li>
<li><a href="#jsJsoRefAndRefSet">5. <code>js#jso</code> and <code>js#ref</code></a>
<ul>
<li><a href="#org3bb17fa">5.1. <code>js#ref</code> and <code>js#ref-set!</code></a></li>
</ul>
</li>
<li><a href="#jsFunctionAndThis">6. <code>js#function</code>, Our first syntax.</a></li>
<li><a href="#org0240bdf">7. <code>##number-&gt;string~</code>, a needed prim.</a></li>
<li><a href="#orgf48a77c">8. <code>js#++</code>, really just to make it short.</a></li>
<li><a href="#orge4b107a">9. <b>Vue.js</b> Render Functions and Gerbil</a>
<ul>
<li><a href="#org0bb7a5c">9.1. <i>File</i> <code>button-counter.ss</code></a></li>
</ul>
</li>
<li><a href="#org0339586">10. Putting it all together</a>
<ul>
<li><a href="#orge334dd2">10.1. Build <code>gxjs</code></a></li>
<li><a href="#orgf7e4e56">10.2. Build the modules</a>
<ul>
<li><a href="#org4799b73">10.2.1. <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</a></li>
</ul>
</li>
<li><a href="#org3a59007">10.3. Now the full gambit repl</a></li>
</ul>
</li>
<li><a href="#org1e111a7">11. <code>Index.vue</code></a></li>
<li><a href="#org3f6651a">12. <code>build.sh</code>: A simple build script</a></li>
</ul>
</div>
</div>
<p>
One of the things I require is <b>Vue.js</b> components written in <b>Gerbil</b> Scheme
and integrated with <b>Quasar</b>.
</p>

<p>
In the past I&rsquo;ve written a <code>vue#component</code> based on my own (previous)
<code>js#plist-&gt;jso</code>. In this log I discovered exactly why I needed that and was able
to rid myself of that need!.
</p>



<div id="outline-container-orgd77d1a9" class="outline-2">
<h2 id="orgd77d1a9"><span class="section-number-2">1</span> Our own <code>g_module_register</code></h2>
<div class="outline-text-2" id="text-1">
<p>
To lazy load our <code>js</code> <b>Gambit</b> modules the <code>g_module_register</code> function has been
slightly re-written. We know from experience that function is defined at the
start of an <code>-exe</code> or in the <code>-link</code> file so if this is added after that and
before the rest, there you go.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_name = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">module_descr</span>) {
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">temp</span> = module_descr[<span style="color: #da8548; font-weight: bold;">0</span>];
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">name</span> = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>].name;
  <span style="color: #51afef;">return</span> name;
};

g_module_init = <span style="color: #51afef;">function</span>(<span style="color: #dcaeea;">module_descr</span>) {
  g_sp = -<span style="color: #da8548; font-weight: bold;">1</span>;
  g_stack[++g_sp] = <span style="color: #51afef;">void</span> <span style="color: #da8548; font-weight: bold;">0</span>;
  g_r0 = g_underflow;
  g_nargs = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_trampoline(module_descr[<span style="color: #da8548; font-weight: bold;">4</span>]);
};

gx_gambit_module_table = [];

g_module_register = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">module_descr</span>) {
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Keep track of all registered modules.</span>
  gx_gambit_module_table.push(module_descr);

  <span style="color: #51afef;">if</span> ( <span style="color: #51afef;">typeof</span> g_glo[<span style="color: #98be65;">'##program-descr'</span>] === <span style="color: #98be65;">'object'</span> ) {
    g_module_init(module_descr);
  } <span style="color: #51afef;">else</span> {
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">temp</span> = module_descr[<span style="color: #da8548; font-weight: bold;">0</span>];
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">name</span> = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>].name;
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = Object.<span style="color: #a9a1e1;">prototype</span>.hasOwnProperty.call(g_module_map,name) ? g_module_map[name] : <span style="color: #a9a1e1;">null</span>;
    g_module_latest_registered = module_descr;
    <span style="color: #51afef;">if</span> (!(info === <span style="color: #a9a1e1;">null</span> || g_module_count === g_module_table.length)) {
      <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">index</span> = info.index;
      <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">old</span> = g_module_table[index];
      g_module_table[index] = module_descr;
      <span style="color: #51afef;">if</span> (old === <span style="color: #a9a1e1;">null</span>) {
        ++g_module_count;
        <span style="color: #51afef;">if</span> (g_module_count === g_module_table.length) {
          g_glo[<span style="color: #98be65;">"##program-descr"</span>] = [g_module_table,<span style="color: #a9a1e1;">null</span>,<span style="color: #a9a1e1;">false</span>];
          temp = g_module_table[g_module_table.length - <span style="color: #da8548; font-weight: bold;">1</span>][<span style="color: #da8548; font-weight: bold;">0</span>];
          g_glo[<span style="color: #98be65;">"##vm-main-module-ref"</span>] = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>];
          g_sp = -<span style="color: #da8548; font-weight: bold;">1</span>;
          g_stack[++g_sp] = <span style="color: #51afef;">void</span> <span style="color: #da8548; font-weight: bold;">0</span>;
          g_r0 = g_underflow;
          g_nargs = <span style="color: #da8548; font-weight: bold;">0</span>;
          g_trampoline(g_module_table[<span style="color: #da8548; font-weight: bold;">0</span>][<span style="color: #da8548; font-weight: bold;">4</span>]);
        }
      }
    }
  }
};

</pre>
</div>

<p>
We also have a way to reset the module registry. We don&rsquo;t actually use it now (I don&rsquo;t think), but it comes in handy.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_reset = <span style="color: #51afef;">function</span> () {
  g_module_count = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_module_map = {};
  g_module_table = <span style="color: #a9a1e1;">null</span>;
  g_module_latest_registered = <span style="color: #a9a1e1;">null</span>;
};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_init = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">link_info</span>) {
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">n</span> = link_info.length;
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_module_registry_reset();
  g_module_table = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Array</span>(n);
  <span style="color: #51afef;">while</span> (i &lt; n) {
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = link_info[i];
    g_module_map[info.name] = info;
    g_module_table[i] = <span style="color: #a9a1e1;">null</span>;
    ++i;
  }
};
</pre>
</div>
</div>
</div>
