doc/log/0003_More-run-time-and-more-vue.org
* ~gxjs-fixes.ss~

Making it into an ~.scm~ file helps to compile it in a way that my head sees as
normal. Since most/all of the others are first ~.ss~ files and our scripts will
assume that, we'll do it that way as well.

Perhaps something else even gets added to this file. We'll see.

#+begin_src scheme :noweb yes :tangle "../../gx/gxjs-fixes.ss"

(##inline-host-declaration #<<EOF
{%g_module_register%}

{%g_module_registry_reset%}

{%g_module_registry_init%}

{%g_scm2host%}

EOF
)
#+end_src


* Change the boot file into aync loading

This way we can see that it is loading and not a blank page. It still loads
almost instantly, but sometimes I add a lot more in there or it recurses
indefinitely.


#+begin_src javascript
import { Loading } from 'quasar'

export default ({ app, router, store, Vue }) => {
  Loading.show()
  console.log('router', router)
  router.beforeEach((to, from, next) => {
    (async () => {
      await import('app/public/gxjs.js')
      Loading.hide()
      next()
    })()
  })
}
#+end_src

* ~js#jso~ and ~js#ref~
:PROPERTIES:
:CUSTOM_ID: jsJsoRefAndRefSet
:END:

While the ~js#plist->jso~ and ~vue#component~ were needed to get to this point,
now that we have the foreign objects going back and forth with ease, we can use
it to make a simple ~js#jso~ constructor function.

#+begin_src scheme :noweb-ref plist-and-jso
(def (js#new-plist->jso plist)
  (def alist [])
  (let lp ((pl plist))
    (if (null? pl)
      (let ((jso ((lambda () (##inline-host-expression "(() => { foo = (@1@);  return g_host2foreign(g_scm2host(foo)); })();"
                                            alist)))))
        ;; (js#console.log jso)
        jso)
        (let* ((key (##car pl))
               (key (if (or (keyword? key) (symbol? key))
                      (##symbol->string key)
                      key))
               (val (##cadr pl))
               (rest (##cddr pl)))
        (set! alist (##cons (##cons key val) alist))
        (lp rest)))))

(def (js#jso . plist)
  (js#new-plist->jso plist))
#+end_src

Now that we have a ~js#jso~, it would be nice to reference its contents.


** ~js#ref~ and ~js#ref-set!~

We can reference a jso and set it fairly easily.

#+begin_src scheme :noweb-ref ref-and-set!
(def (js#ref obj ref)
  (##inline-host-expression "((obj, ref) => {
   if (obj instanceof G_Foreign) {
      obj = g_foreign2host(obj);
   }
return obj[ref];

})(@1@, @2@);" obj ref))

(def (js#ref-set! obj ref val)
  (##inline-host-expression "((obj, ref, val) => {
   if (obj instanceof G_Foreign) {
      obj = g_foreign2host(obj);
   }
return (obj[ref] = val);

})(@1@, @2@, @3@);" obj ref val))
#+end_src

* ~js#function~, Our first syntax.
:PROPERTIES:
:CUSTOM_ID: jsFunctionAndThis
:END:

Now that we have the foreign objects, which I think of as ~*pointers~ really, or
wrappers to pointers, but I digress... now that we have
~g_[host|scm]2[scm|host]~ working with foreign types making a ~js#function~ that
interacts with the browser is fairly trivial.

Declaring ~js#this~ is really the big idea. We need it to do the entire point
behind this log.

#+begin_src scheme  :tangle ../../gx/syntax.ss
namespace: #f
(export js#function js#this)

(def js#this (##inline-host-expression "window;"))

(defsyntax (js#function stx)
  (syntax-case stx ()
    ((macro _args body ...)
     (let* ((args (syntax->datum #'_args))
            (binds (let lp ((bs args) (n 0))
                     (if (null? bs) bs
                         (cons (list (car bs) `(##vector-ref js#arguments ,n))
                               (lp (cdr bs) (+ n 1)))))))
       (with-syntax ((lbinds (datum->syntax #'macro binds))
                     (this
                      (datum->syntax #'macro 'js#this))
                     (args (datum->syntax #'macro 'js#arguments)))
           #'(let ((fn (lambda (this args) (let lbinds body ...))))
               (js#js->foreign (##inline-host-expression
                              "function (...args) { let scmProc = g_scm2host(@1@);
  return scmProc(this, args);
   };" fn))))))))
#+end_src



* ~##number->string~~, a needed prim.

#+begin_src scheme :noweb-ref number->string
(def (##number->string n)
  (##inline-host-expression "(() => { n = g_scm2host(@1@) ; return g_host2scm(n.toString()); })();" n))
#+end_src

* ~js#++~, really just to make it short.

In *Common Lisp* there's ~INCF~, "used for incrementing [...] the value of
place". We'll create a ~js#++~ macro just to line up with our recreation which is coming soon.

#+begin_src scheme :noweb-ref js-++
(defsyntax (js#++ stx)
  (syntax-case stx ()
    ((macro place number)
       #'(let ((val place))
           (set! place (+ val number))))
    ((macro place)
     #'(macro place 1))))
#+end_src


