public/log/0003_More-run-time-and-more-vue.html


<div id="outline-container-org1d1b6c3" class="outline-2">
<h2 id="org1d1b6c3"><span class="section-number-2">4</span> Change the boot file into aync loading</h2>
<div class="outline-text-2" id="text-4">
<p>
This way we can see that it is loading and not a blank page. It still loads
almost instantly, but sometimes I add a lot more in there or it recurses
indefinitely.
</p>


<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">import</span> { Loading } from <span style="color: #98be65;">'quasar'</span>

<span style="color: #51afef;">export</span> <span style="color: #51afef;">default</span> ({ app, router, store, Vue }) =&gt; {
  Loading.show()
  console.log(<span style="color: #98be65;">'router'</span>, router)
  router.beforeEach((to, from, next) =&gt; {
    (<span style="color: #51afef;">async</span> () =&gt; {
      <span style="color: #51afef;">await</span> <span style="color: #51afef;">import</span>(<span style="color: #98be65;">'app/public/gxjs.js'</span>)
      Loading.hide()
      next()
    })()
  })
}
</pre>
</div>
</div>
</div>

<div id="outline-container-jsJsoRefAndRefSet" class="outline-2">
<h2 id="jsJsoRefAndRefSet"><span class="section-number-2">5</span> <code>js#jso</code> and <code>js#ref</code></h2>
<div class="outline-text-2" id="text-jsJsoRefAndRefSet">
<p>
While the <code>js#plist-&gt;jso</code> and <code>vue#component</code> were needed to get to this point,
now that we have the foreign objects going back and forth with ease, we can use
it to make a simple <code>js#jso</code> constructor function.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js#new-plist-&gt;jso</span> plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">alist</span> <span style="color: #dcaeea;">[]</span>)
  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">lp</span> ((pl plist))
    (<span style="color: #51afef;">if</span> (null? pl)
      (<span style="color: #51afef;">let</span> ((jso ((<span style="color: #51afef;">lambda</span> () (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"(() =&gt; { foo = (@1@);  return g_host2foreign(g_scm2host(foo)); })();"</span>
                                            alist)))))
        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(js#console.log jso)</span>
        jso)
        (<span style="color: #51afef;">let*</span> ((key (<span style="color: #c678dd;">##</span>car pl))
               (key (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">or</span> (keyword? key) (symbol? key))
                      (<span style="color: #c678dd;">##</span>symbol-&gt;string key)
                      key))
               (val (<span style="color: #c678dd;">##</span>cadr pl))
               (rest (<span style="color: #c678dd;">##</span>cddr pl)))
        (<span style="color: #51afef;">set!</span> alist (<span style="color: #c678dd;">##</span>cons (<span style="color: #c678dd;">##</span>cons key val) alist))
        (lp rest)))))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js#jso</span> . plist)
  (js<span style="color: #c678dd;">#</span>new-plist-&gt;jso plist))
</pre>
</div>

<p>
Now that we have a <code>js#jso</code>, it would be nice to reference its contents.
</p>
</div>


<div id="outline-container-org3bb17fa" class="outline-3">
<h3 id="org3bb17fa"><span class="section-number-3">5.1</span> <code>js#ref</code> and <code>js#ref-set!</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
We can reference a jso and set it fairly easily.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js#ref</span> obj ref)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"((obj, ref) =&gt; {</span>
<span style="color: #98be65;">   if (obj instanceof G_Foreign) {</span>
<span style="color: #98be65;">      obj = g_foreign2host(obj);</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">return obj[ref];</span>

<span style="color: #98be65;">})(@1@, @2@);"</span> obj ref))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">js#ref-set!</span> obj ref val)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"((obj, ref, val) =&gt; {</span>
<span style="color: #98be65;">   if (obj instanceof G_Foreign) {</span>
<span style="color: #98be65;">      obj = g_foreign2host(obj);</span>
<span style="color: #98be65;">   }</span>
<span style="color: #98be65;">return (obj[ref] = val);</span>

<span style="color: #98be65;">})(@1@, @2@, @3@);"</span> obj ref val))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-jsFunctionAndThis" class="outline-2">
<h2 id="jsFunctionAndThis"><span class="section-number-2">6</span> <code>js#function</code>, Our first syntax.</h2>
<div class="outline-text-2" id="text-jsFunctionAndThis">
<p>
Now that we have the foreign objects, which I think of as <code>*pointers</code> really, or
wrappers to pointers, but I digress&#x2026; now that we have
<code>g_[host|scm]2[scm|host]</code> working with foreign types making a <code>js#function</code> that
interacts with the browser is fairly trivial.
</p>

<p>
Declaring <code>js#this</code> is really the big idea. We need it to do the entire point
behind this log.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> <span style="color: #c678dd;">#f</span>
(<span style="color: #51afef;">export</span> js<span style="color: #c678dd;">#</span>function js<span style="color: #c678dd;">#</span>this)

(<span style="color: #51afef;">def</span> <span style="color: #c678dd;">js#this</span> (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"window;"</span>))

(<span style="color: #51afef;">defsyntax</span> (<span style="color: #dcaeea;">js#function</span> stx)
  (<span style="color: #51afef;">syntax-case</span> stx ()
    ((macro <span style="color: #c678dd;">_</span>args body <span style="color: #c678dd;">...</span>)
     (<span style="color: #51afef;">let*</span> ((args (syntax-&gt;datum <span style="color: #51afef;">#'</span><span style="color: #c678dd;">_</span>args))
            (binds (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">lp</span> ((bs args) (n 0))
                     (<span style="color: #51afef;">if</span> (null? bs) bs
                         (cons (list (car bs) <span style="color: #51afef;">`</span>(<span style="color: #c678dd;">##</span>vector-ref js<span style="color: #c678dd;">#</span>arguments <span style="color: #51afef;">,</span>n))
                               (lp (cdr bs) (+ n 1)))))))
       (<span style="color: #51afef;">with-syntax</span> ((lbinds (datum-&gt;syntax <span style="color: #51afef;">#'</span>macro binds))
                     (this
                      (datum-&gt;syntax <span style="color: #51afef;">#'</span>macro <span style="color: #51afef;">'</span>js<span style="color: #c678dd;">#</span>this))
                     (args (datum-&gt;syntax <span style="color: #51afef;">#'</span>macro <span style="color: #51afef;">'</span>js<span style="color: #c678dd;">#</span>arguments)))
           <span style="color: #51afef;">#'</span>(<span style="color: #51afef;">let</span> ((fn (<span style="color: #51afef;">lambda</span> (this args) (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">lbinds</span> body <span style="color: #c678dd;">...</span>))))
               (js<span style="color: #c678dd;">#</span>js-&gt;foreign (<span style="color: #c678dd;">##</span>inline-host-expression
                              <span style="color: #98be65;">"function (...args) { let scmProc = g_scm2host(@1@);</span>
<span style="color: #98be65;">  return scmProc(this, args);</span>
<span style="color: #98be65;">   };"</span> fn))))))))
</pre>
</div>
</div>
</div>



<div id="outline-container-org0240bdf" class="outline-2">
<h2 id="org0240bdf"><span class="section-number-2">7</span> <code>##number-&gt;string~</code>, a needed prim.</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">##number-&gt;string</span> n)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"(() =&gt; { n = g_scm2host(@1@) ; return g_host2scm(n.toString()); })();"</span> n))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf48a77c" class="outline-2">
<h2 id="orgf48a77c"><span class="section-number-2">8</span> <code>js#++</code>, really just to make it short.</h2>
<div class="outline-text-2" id="text-8">
<p>
In <b>Common Lisp</b> there&rsquo;s <code>INCF</code>, &ldquo;used for incrementing [&#x2026;] the value of
place&rdquo;. We&rsquo;ll create a <code>js#++</code> macro just to line up with our recreation which is coming soon.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">defsyntax</span> (<span style="color: #dcaeea;">js#++</span> stx)
  (<span style="color: #51afef;">syntax-case</span> stx ()
    ((macro place number)
       <span style="color: #51afef;">#'</span>(<span style="color: #51afef;">let</span> ((val place))
           (<span style="color: #51afef;">set!</span> place (+ val number))))
    ((macro place)
     <span style="color: #51afef;">#'</span>(macro place 1))))
</pre>
</div>
</div>
</div>
