doc/log/0003_More-run-time-and-more-vue.org
* Putting it all together

Now to embed everything into a ~:js~ *Gerbil* package.

#+begin_src scheme :tangle ../../gx/gerbil.pkg
(package: js)
#+end_src

We'll have 3 steps.

 1) ~gxjs~ :: Our basic run time
 2) All the lazy modules
 3) The gambit repl (done the old way)

Our ~_comp~ shell function takes a ~.ss~, makes a ~static/.scm~ and compiles that to a ~.js~.

#+begin_src shell :noweb-ref compiler-shell
_gxc () {
    _givr="gxc -d . -S -static $1"
 echo "--- Compiling $_givr"; $_givr || exit 1 ;
}
_statics=""

_gsc () {
 _js=$(basename $1 .scm).js
 _js=`echo $_js | sed 's/js__\(.*\)/\1/'`
 _statics="$_statics $1"

  echo "--- compiling $1 to $_js"
  gsc -target js -o  $_js $1 || exit 2; echo;
}

_comp () {
 _fn=$(basename $1 .ss)
 _st=static/js__$_fn.scm

 _gxc $1;
 _gsc $_st;
 }
#+end_src

** Build ~gxjs~

#+begin_src shell :noweb-ref build-gxjs
gxc -v syntax.ss
_comp gxjs-fixes.ss
_comp syntax.ss
_comp gxjs-init.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

echo "Compiling a gxjs-link.js file from our statics and the _gambit.js runtime."
gsc -target js -o gxjs-link.js -link $_statics

_gxjs_rt='cat gxjs-link.js gxjs-fixes.js syntax.js gxjs-init.js gxjs-rt.js gxjs-ffi.js > gxjs.js'; echo making exec: $_gxjs_rt; bash -c "$_gxjs_rt";

cp gxjs.js ../public/
#+end_src

** Build the modules

1) vue
2) hello
3) gambit-module-test
4) button-counter

#+begin_src shell :noweb-ref build-modules
_comp vue.ss
_comp hello.ss
_comp gambit-module-test.ss
_comp button-counter.ss

cp vue.js hello.js gambit-module-test.js button-counter.js ../public
#+end_src

*** ~gambit-module-test.ss~: A module not loaded in the gambit program

#+begin_src scheme :tangle ../../gx/gambit-module-test.ss
(##inline-host-statement
 "exports.Test = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Test' + arg)
}

console.log('init gambit-module-test');

"
 (lambda (str)
   (let* ((mod (##inline-host-expression "g_module_name(gx_gambit_module_table[1]);")))
     (js#console.log mod)
     (js#alert str))))
#+end_src

** Now the full gambit repl

This time we try without the module reset/init.

#+begin_src shell :noweb-ref build-repl
_comp lazy-gambit-repl.ss
_lazy="cat lazy-gambit-repl.js $(gsc -e '(display (path-expand "~~lib/_gambit.js"))')  > gambit-repl.js"
echo Building the gambit repl: \"$_lazy\"; bash -c "$_lazy";
cp gambit-repl.js ../public
#+end_src


#+begin_src scheme :tangle ../../gx/lazy-gambit-repl.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(##inline-host-statement
 "exports.evalElement = (arg) => {
  alert('Lazy? This is working without the reset Hello ' + arg)
}"
)

(define (document.getElementById id)
  (##inline-host-expression "g_host2foreign(document.getElementById(g_scm2host(@1@)))" id))

(define (Element.innerText-ref elem)
  (##inline-host-expression "g_host2scm(g_foreign2host(@1@).innerText)" elem))

(define (g-sourceCodeRun id)
  (let* ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (let ((expr (cons '##begin (with-input-from-string code read-all))))
      (eval expr))

    ))

(##inline-host-declaration "g_sourceCodeRun = function () { alert('sourceCodeRun'); };")

(##inline-host-statement "
g_sourceCodeRun = g_scm2host(@1@);
exports.sourceCodeRun = g_sourceCodeRun;" g-sourceCodeRun)

#+end_src

