public/log/0003_More-run-time-and-more-vue.html

<div id="outline-container-org0339586" class="outline-2">
<h2 id="org0339586"><span class="section-number-2">10</span> Putting it all together</h2>
<div class="outline-text-2" id="text-10">
<p>
Now to embed everything into a <code>:js</code> <b>Gerbil</b> package.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">package:</span> js)
</pre>
</div>

<p>
We&rsquo;ll have 3 steps.
</p>

<ol class="org-ol">
<li><code>gxjs</code> :: Our basic run time</li>
<li>All the lazy modules</li>
<li>The gambit repl (done the old way)</li>
</ol>

<p>
Our <code>_comp</code> shell function takes a <code>.ss</code>, makes a <code>static/.scm</code> and compiles that to a <code>.js</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">_gxc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #dcaeea;">_givr</span>=<span style="color: #98be65;">"gxc -d . -S -static </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>
 <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- Compiling $_givr"</span>; $<span style="color: #dcaeea;">_givr</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">1</span> ;
<span style="color: #51afef;">}</span>
<span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">""</span>

<span style="color: #c678dd;">_gsc</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_js</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .scm<span style="color: #c678dd;">)</span>.js
 <span style="color: #dcaeea;">_js</span>=<span style="color: #51afef; font-weight: bold;">`</span><span style="color: #51afef; font-weight: bold;">echo</span><span style="color: #51afef; font-weight: bold;"> $_js | sed 's/js__\(.*\)/\1/'`</span>
 <span style="color: #dcaeea;">_statics</span>=<span style="color: #98be65;">"$_statics </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;">"</span>

  <span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"--- compiling </span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">1</span><span style="color: #98be65;"> to $_js"</span>
  gsc -target js -o  $<span style="color: #dcaeea;">_js</span> $<span style="color: #da8548; font-weight: bold;">1</span> || <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">2</span>; <span style="color: #ECBE7B;">echo</span>;
<span style="color: #51afef;">}</span>

<span style="color: #c678dd;">_comp</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
 <span style="color: #dcaeea;">_fn</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #da8548; font-weight: bold;">1</span> .ss<span style="color: #c678dd;">)</span>
 <span style="color: #dcaeea;">_st</span>=static/js__$<span style="color: #dcaeea;">_fn</span>.scm

 _gxc $<span style="color: #da8548; font-weight: bold;">1</span>;
 _gsc $<span style="color: #dcaeea;">_st</span>;
 <span style="color: #51afef;">}</span>
</pre>
</div>
</div>

<div id="outline-container-orge334dd2" class="outline-3">
<h3 id="orge334dd2"><span class="section-number-3">10.1</span> Build <code>gxjs</code></h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-shell">gxc -v syntax.ss
_comp gxjs-fixes.ss
_comp syntax.ss
_comp gxjs-init.ss
_comp gxjs-rt.ss
_comp gxjs-ffi.ss

<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Compiling a gxjs-link.js file from our statics and the _gambit.js runtime."</span>
gsc -target js -o gxjs-link.js -link $<span style="color: #dcaeea;">_statics</span>

<span style="color: #dcaeea;">_gxjs_rt</span>=<span style="color: #98be65;">'</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> gxjs-link.js gxjs-fixes.js syntax.js gxjs-init.js gxjs-rt.js gxjs-ffi.js &gt; gxjs.js'</span>; <span style="color: #ECBE7B;">echo</span> making exec: $<span style="color: #dcaeea;">_gxjs_rt</span>; bash -c <span style="color: #98be65;">"$_gxjs_rt"</span>;

<span style="color: #ECBE7B;">cp</span> gxjs.js ../public/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7e4e56" class="outline-3">
<h3 id="orgf7e4e56"><span class="section-number-3">10.2</span> Build the modules</h3>
<div class="outline-text-3" id="text-10-2">
<ol class="org-ol">
<li>vue</li>
<li>hello</li>
<li>gambit-module-test</li>
<li>button-counter</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">_comp vue.ss
_comp hello.ss
_comp gambit-module-test.ss
_comp button-counter.ss

<span style="color: #ECBE7B;">cp</span> vue.js hello.js gambit-module-test.js button-counter.js ../public
</pre>
</div>
</div>

<div id="outline-container-org4799b73" class="outline-4">
<h4 id="org4799b73"><span class="section-number-4">10.2.1</span> <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</h4>
<div class="outline-text-4" id="text-10-2-1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Test = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Test' + arg)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">console.log('init gambit-module-test');</span>

<span style="color: #98be65;">"</span>
 (<span style="color: #51afef;">lambda</span> (str)
   (<span style="color: #51afef;">let*</span> ((mod (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_module_name(gx_gambit_module_table[1]);"</span>)))
     (js<span style="color: #c678dd;">#</span>console.log mod)
     (js<span style="color: #c678dd;">#</span>alert str))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a59007" class="outline-3">
<h3 id="org3a59007"><span class="section-number-3">10.3</span> Now the full gambit repl</h3>
<div class="outline-text-3" id="text-10-3">
<p>
This time we try without the module reset/init.
</p>

<div class="org-src-container">
<pre class="src src-shell">_comp lazy-gambit-repl.ss
<span style="color: #dcaeea;">_lazy</span>=<span style="color: #98be65;">"</span><span style="color: #98be65;">cat</span><span style="color: #98be65;"> lazy-gambit-repl.js </span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">gsc</span><span style="color: #51afef; font-weight: bold;"> -e '(display (path-expand "~~lib/_gambit.js")</span><span style="color: #98be65;">)')  &gt; gambit-repl.js"</span>
<span style="color: #ECBE7B;">echo</span> Building the gambit repl: <span style="color: #98be65;">\"</span>$<span style="color: #dcaeea;">_lazy</span><span style="color: #98be65;">\"</span>; bash -c <span style="color: #98be65;">"$_lazy"</span>;
<span style="color: #ECBE7B;">cp</span> gambit-repl.js ../public
</pre>
</div>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.evalElement = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Lazy? This is working without the reset Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
)

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">document.getElementById</span> id)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(document.getElementById(g_scm2host(@1@)))"</span> id))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">Element.innerText-ref</span> elem)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(g_foreign2host(@1@).innerText)"</span> elem))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">g-sourceCodeRun</span> id)
  (<span style="color: #51afef;">let*</span> ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (<span style="color: #51afef;">let</span> ((expr (cons <span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>begin (with-input-from-string code read-all))))
      (<span style="color: #51afef;">eval</span> expr))

    ))

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"g_sourceCodeRun = function () { alert('sourceCodeRun'); };"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"</span>
<span style="color: #98be65;">g_sourceCodeRun = g_scm2host(@1@);</span>
<span style="color: #98be65;">exports.sourceCodeRun = g_sourceCodeRun;"</span> g-sourceCodeRun)

</pre>
</div>
</div>
</div>
</div>
